//非編集用ファイルの初期設定
if(localStorage.getItem("file_11_Company") == null){
    localStorage.setItem("file_11_Company","\
    <h2><11月18日(金)></h2><br>\
    日本,10月全国消費者物価指数<br>\
    日本,10月全国消費者物価指数<br>\
    イギリス,11月ＧＦＫ消費者信頼感調査<br>\
    イギリス,10月小売売上高(前月比)<br>\
    イギリス,10月小売売上高(前年同月比)<br>\
    イギリス,10月小売売上高（除自動車）(前月比)<br>\
    イギリス,10月小売売上高（除自動車）(前年同月比)<br>\
    ノルウェー,7-9月期四半期国内総生産（ＧＤＰ）(前期比)<br>\
    スイス	7-9月期四半期鉱工業生産 (前年同期比)<br>\
    ユーロ, ラガルド欧州中央銀行(ＥＣＢ)総裁、発言<br>\
    カナダ,9月対カナダ証券投資額<br>\
    カナダ,10月鉱工業製品価格(前月比)<br>\
    カナダ,10月原料価格指数(前月比)<br>\
    米国,10月中古住宅販売件数(年率換算件数)<br>\
    米国,10月中古住宅販売件数(前月比)<br>\
    米国,10月景気先行指標総合指数(前月比)<br>\
    <h2><11月21日（月）></h2><br><br>\
    11/21,ドイツ10月生産者物価指数（ＰＰＩ）(前月比)<br>\
    11/21,香港10月消費者物価指数（ＣＰＩ）(前年比)\<br>\
    <h2><11月22日（火）></h2><br>\
    11/22, ニュージーランド10月貿易収支<br>\
    11/22,ユーロ9月経常収支（季調済)<br>\
    11/22,カナダ9月小売売上高(前月比)<br>\
    11/22,カナダ9月小売売上高（除自動車<br>\
    11/22,ユーロ11月消費者信頼感（速報値)<br>\
    11/22,米国11月リッチモンド連銀製造業指数\ ");

    localStorage.setItem("file_12_Company","<h2><11月14日(月)></h2><br> 決算:GMOペイメントゲートウェイ（3769）、電通グループ（4324）、ハピネット（7552）、第一生命ホール\
    ディングス（8750<br> 欧9月鉱工業生産<br> 印10月消費者物価指数（CPI）<br> 決算:アゼンタ（AZTA）<br> <h2><11月15日（火）></h3><br> ベースフード（2936）東証グロース上場<br>\
     POPER（5134）東証グロース上場<br> 9月鉱工業生産確報値<br> 7-9月期四半期実質国内総生産（GDP）速報値<br> 中10月小売売上高<br> 中10月鉱工業生産<br> 独11月ZEW景況感調査<br> \
     欧7-9月期四半期域内総生産（GDP）改定値<br> 米11月ニューヨーク連銀製造業景気指数<br> 米10月卸売物価指数（PPI）<br> 決算:ウォルマート（WMT）<br> <h2><11月16日（水）></h2>\
     <br> 9月機械受注<br> 9月第三次産業活動指数<br> 英10月消費者物価指数（CPI）<br> 加10月消費者物価指数（CPI）<br> 米10月小売売上高<br> 米10月鉱工業生産<br> 決算:エヌビディア\
     （NVDA）<br> <h2><11月17日（木）></h2><br> 10月貿易統計<br> 欧10月消費者物価指数（HICP）改定値<br> 米10月住宅着工件数<br> 米11月フィラデルフィア連銀製造業景気指数<br> 決\
     算:アプライド マテリアルズ（AMAT）、シスコシステムズ（CSCO）、ギャップ（GPS）<br> <h2><11月18日（金）></h2><br> 決算:SOMPOホールディングス（8630）、東京海上ホールディング\
     ス（8766）<br> 10月全国消費者物価指数（CPI）<br> 英10月小売売上高<br> 米10月中古住宅販売件数<br> \
     米10月景気先行指標総合指数<br>");
     
    localStorage.setItem("file_archive","<h1>ホームページ作成プロジェクト</h1><br>2022/11/16<br>しんば株式会社<br>Aチーム<br>\
    <h3>プロジェクト名</h3>:新規ホームページ制作プロジェクト<br>\
    <h3>開発期間</h3>：9か月<br>\
    <h3>日程</h3>:2022/3/1~2022/12/1<br>\
    <h3>メンバー</h3>:大川、松田、山田、村上、原田<br>\
    <h3>目的</h3>:新規顧客獲得と売上のUP<br>\ ");
    localStorage.setItem("file_file111","１６日前場の日経平均株価は前日比３４円３２銭安の２万７９５５円８５銭と小反落。\
    朝方は,日の米国株高を支えに強含んで始まったが、まもなく下げに転じた。\
    ポーランド外務省は１５日、ロシア製ミサイルが国内に着弾し２人が死亡したと発表。\
    北大西洋条約機構（ＮＡＴＯ）加盟国内で初めて被害を受けたことで、地政学リスクが警戒された。\
    株価指数先物主導で下げ幅を拡大し、一時２万７７４３円１５銭（前日比２４７円０２銭安）まで下落する場面があった。\
    一巡後は買い戻しに下げ渋りの流れとなり、小安い水準まで引き戻した。なかで、資源関連株や半導体関連株の一角などは堅調だった。\
    <br>東証プライムの出来高は６億１９５７万株、売買代金は１兆８４３９億円。騰落銘柄数は値上がり９２２銘柄、値下がり８２２銘柄、変わらず９１銘柄。\
    <br>市場からは「地政学リスクへの警戒感はあるが、ロシアとポーンラドを巡る問題は、あくまでも偶発的として、ＮＡＴＯも米国もおおごとにはしないだろう。\
    むしろ、日経平均２万８０００円以上の上値は重く、地政学リスクをきっかけに利益確定売りを促したとみられる(銀行系証券)との声が聞かれた。\
    <br>業種別では、Ｔ＆ＤＨＤ <8795> 、第一生命ＨＤ <8750> 、東京海上 <8766> などの保険株が下落。ブリヂス <5108> 、浜ゴム <5101> などの\
    ゴム製品株や、オリンパス <7733> 、ＨＯＹＡ <7741> 、テルモ <4543> などの精密株も安い。ＪＡＬ <9201> 、ＡＮＡ <9202> などの空\
    運株や、ＪＲ東海 <9022> 、ＪＲ西日本 <9021> 、西武ＨＤ <9024> などの陸運株も売られた。大和証Ｇ <8601> 、野村 <8604> などの証券商品先物株も値を下げた。\
    <br>半面、ＩＮＰＥＸ <1605> 、石油資源 <1662> などの鉱業株が堅調。三井物産 <8031> 、丸紅 <8002> 、住友商 <8053> などの卸売株も高く、ソフバ\
    ンＧ <9984> 、ＮＲＩ <4307> などの情報通信株も買われた。三井倉ＨＤ <9302> 、三菱倉 <9301> 、上組 <9364> などの倉庫運輸関連株も値を上げた。\
    <br>個別では、日医工 <4541> （監理）がストップ安ウリ気配となり、シンクロＦ <3963> 、アルヒ <7198> 、ＢＥＥＮＯＳ <3328> などの下げが目立った。\
    半面、ギフティ <4449> 、ＤＩＴ <3916> 、メニコン <7780> 、ホットランド <3196> などが騰勢を強めた。なお、東証業種別株価指数は全３３業種中、２０\
    業種が下落した。");
    localStorage.setItem("file_projectAA","<h1>POS導入プロジェクト</h1><br>2022/11/16<br>しんば株式会社<br>Bチーム<br>\
    <h3>プロジェクト名</h3>:新規POSシステム導入プロジェクト<br>\
    <h3>開発期間</h3>：6か月<br>\
    <h3>日程</h3>:2022/6/1~2022/12/1<br>\
    <h3>メンバー</h3>:大野、松井、山本、村本、山上<br>\
    <h3>目的</h3>:電子マネーの導入による新規顧客獲得と従業員の仕事効率のUP<br>\ ");
    localStorage.setItem("file_projectXX","<h1>アプリ開発プロジェクト</h1><br>2022/11/16<br>しんば株式会社<br>Cチーム<br>\
    <h3>プロジェクト名</h3>:店舗アプリ政策導入プロジェクト<br>\
    <h3>開発期間</h3>：１年<br>\
    <h3>日程</h3>:2022/12/1~2023/12/1<br>\
    <h3>メンバー</h3>:矢野、井端、松本、村瀬、吉田<br>\
    <h3>目的</h3>:クーポン機能、ポイント機能、混雑状況機能の搭載による集客数のUP<br>\ ");
}

function passfile(){
    
}